app/views/comments/_comment.html.erb

	<p><strong>
	Posted <%= time_ago_in_words(comment.created_at) %> ago
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hi there"], ["created_at", Tue, 04 Oct 2011 00:12:51 UTC +00:00], ["post_id", 2], ["updated_at", Tue, 04 Oct 2011 00:12:51 UTC +00:00]]