app/controllers/comments_controller.rb

  def create
	@post = Post.find(params[:post_id])
	@comment = @post.comments.create!(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Moisturize me"], ["created_at", Mon, 03 Oct 2011 21:35:44 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 03 Oct 2011 21:35:44 UTC +00:00]]