app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "My favorite quotes"], ["created_at", Mon, 03 Oct 2011 21:35:18 UTC +00:00], ["title", "Favorite Quotes"], ["updated_at", Mon, 03 Oct 2011 21:35:18 UTC +00:00]]